Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxEdsadc_PinMap_TC38x_LFBGA516.c
const IfxEdsadc_Cgpwm_Out *IfxEdsadc_Cgpwm_Out_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_CGPWM_OUT_NUM_ITEMS] = {
    {
        &IfxEdsadc_CGPWMN_P00_5_OUT,
        &IfxEdsadc_CGPWMP_P00_6_OUT,
        &IfxEdsadc_CGPWMN_P02_0_OUT,
        &IfxEdsadc_CGPWMP_P02_1_OUT,
        &IfxEdsadc_CGPWMN_P33_11_OUT,
        &IfxEdsadc_CGPWMP_P33_12_OUT
    }
};

const IfxEdsadc_Dscin_In *IfxEdsadc_Dscin_In_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_NUM_CHANNELS][IFXEDSADC_PINMAP_DSCIN_IN_NUM_ITEMS] = {
    {
        {
            &IfxEdsadc_DSCIN0A_P00_11_IN,
            &IfxEdsadc_DSCIN0B_P33_5_IN
        },
        {
            &IfxEdsadc_DSCIN1A_P00_9_IN,
            &IfxEdsadc_DSCIN1B_P33_3_IN
        },
        {
            &IfxEdsadc_DSCIN2A_P00_5_IN,
            &IfxEdsadc_DSCIN2B_P33_1_IN
        },
        {
            &IfxEdsadc_DSCIN3A_P00_3_IN,
            &IfxEdsadc_DSCIN3B_P02_7_IN
        },
        {
            &IfxEdsadc_DSCIN4A_P00_7_IN,
            &IfxEdsadc_DSCIN4B_P02_5_IN
        },
        {
            &IfxEdsadc_DSCIN5A_P00_1_IN,
            &IfxEdsadc_DSCIN5B_P02_3_IN
        },
        {
            &IfxEdsadc_DSCIN6A_P00_14_IN,
            NULL_PTR
        },
        {
            &IfxEdsadc_DSCIN7A_P01_2_IN,
            &IfxEdsadc_DSCIN7B_P00_1_IN
        },
        {
            &IfxEdsadc_DSCIN8A_P01_5_IN,
            NULL_PTR
        },
        {
            &IfxEdsadc_DSCIN9A_P01_9_IN,
            NULL_PTR
        }
    }
};

const IfxEdsadc_Dscout_Out *IfxEdsadc_Dscout_Out_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_NUM_CHANNELS][IFXEDSADC_PINMAP_DSCOUT_OUT_NUM_ITEMS] = {
    {
        {
            &IfxEdsadc_DSCOUT0_P00_11_OUT,
            &IfxEdsadc_DSCOUT0_P33_5_OUT
        },
        {
            &IfxEdsadc_DSCOUT1_P00_9_OUT,
            &IfxEdsadc_DSCOUT1_P33_3_OUT
        },
        {
            &IfxEdsadc_DSCOUT2_P00_5_OUT,
            &IfxEdsadc_DSCOUT2_P33_1_OUT
        },
        {
            &IfxEdsadc_DSCOUT3_P00_3_OUT,
            &IfxEdsadc_DSCOUT3_P02_7_OUT
        },
        {
            &IfxEdsadc_DSCOUT4_P00_7_OUT,
            &IfxEdsadc_DSCOUT4_P02_5_OUT
        },
        {
            &IfxEdsadc_DSCOUT5_P00_1_OUT,
            &IfxEdsadc_DSCOUT5_P02_3_OUT
        },
        {
            &IfxEdsadc_DSCOUT6_P00_14_OUT,
            NULL_PTR
        },
        {
            &IfxEdsadc_DSCOUT7_P00_1_OUT,
            &IfxEdsadc_DSCOUT7_P01_2_OUT
        },
        {
            &IfxEdsadc_DSCOUT8_P01_5_OUT,
            NULL_PTR
        },
        {
            &IfxEdsadc_DSCOUT9_P01_9_OUT,
            NULL_PTR
        }
    }
};

const IfxEdsadc_Dsdin_In *IfxEdsadc_Dsdin_In_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_NUM_CHANNELS][IFXEDSADC_PINMAP_DSDIN_IN_NUM_ITEMS] = {
    {
        {
            &IfxEdsadc_DSDIN0A_P00_12_IN,
            &IfxEdsadc_DSDIN0B_P33_6_IN
        },
        {
            &IfxEdsadc_DSDIN1A_P00_10_IN,
            &IfxEdsadc_DSDIN1B_P33_4_IN
        },
        {
            &IfxEdsadc_DSDIN2A_P00_6_IN,
            &IfxEdsadc_DSDIN2B_P33_2_IN
        },
        {
            &IfxEdsadc_DSDIN3A_P00_4_IN,
            &IfxEdsadc_DSDIN3B_P02_8_IN
        },
        {
            &IfxEdsadc_DSDIN4A_P00_8_IN,
            &IfxEdsadc_DSDIN4B_P02_6_IN
        },
        {
            &IfxEdsadc_DSDIN5A_P00_2_IN,
            &IfxEdsadc_DSDIN5B_P02_4_IN
        },
        {
            &IfxEdsadc_DSDIN6A_P00_13_IN,
            NULL_PTR
        },
        {
            &IfxEdsadc_DSDIN7A_P01_15_IN,
            &IfxEdsadc_DSDIN7B_P00_2_IN
        },
        {
            &IfxEdsadc_DSDIN8A_P01_6_IN,
            NULL_PTR
        },
        {
            &IfxEdsadc_DSDIN9A_P01_8_IN,
            NULL_PTR
        }
    }
};

const IfxEdsadc_Dsn_In *IfxEdsadc_Dsn_In_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_NUM_CHANNELS][IFXEDSADC_PINMAP_DSN_IN_NUM_ITEMS] = {
    {
        {
            &IfxEdsadc_DS0NA_AN3_IN,
            &IfxEdsadc_DS0NB_AN13_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS1NA_P40_7_IN,
            &IfxEdsadc_DS1NB_P40_9_IN,
            &IfxEdsadc_DS1NC_AN45_IN,
            &IfxEdsadc_DS1ND_AN47_IN
        },
        {
            &IfxEdsadc_DS2NA_AN21_IN,
            &IfxEdsadc_DS2NB_P40_1_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS3NA_AN1_IN,
            &IfxEdsadc_DS3NB_AN15_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS4NA_P00_7_IN,
            &IfxEdsadc_DS4NB_P00_9_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS5NA_P00_1_IN,
            &IfxEdsadc_DS5NB_P00_3_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS6NA_AN53_IN,
            &IfxEdsadc_DS6NB_P41_5_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS7NA_AN61_IN,
            &IfxEdsadc_DS7NB_P41_7_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS8NA_P41_1_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS9NA_AN51_IN,
            &IfxEdsadc_DS9NB_P41_3_IN,
            NULL_PTR,
            NULL_PTR
        }
    }
};

const IfxEdsadc_Dsp_In *IfxEdsadc_Dsp_In_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_NUM_CHANNELS][IFXEDSADC_PINMAP_DSP_IN_NUM_ITEMS] = {
    {
        {
            &IfxEdsadc_DS0PA_AN2_IN,
            &IfxEdsadc_DS0PB_AN12_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS1PA_P40_6_IN,
            &IfxEdsadc_DS1PB_P40_8_IN,
            &IfxEdsadc_DS1PC_AN44_IN,
            &IfxEdsadc_DS1PD_AN46_IN
        },
        {
            &IfxEdsadc_DS2PA_AN20_IN,
            &IfxEdsadc_DS2PB_P40_0_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS3PA_AN0_IN,
            &IfxEdsadc_DS3PB_AN14_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS4PA_P00_8_IN,
            &IfxEdsadc_DS4PB_P00_10_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS5PA_P00_2_IN,
            &IfxEdsadc_DS5PB_P00_4_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS6PA_AN52_IN,
            &IfxEdsadc_DS6PB_P41_4_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS7PA_AN60_IN,
            &IfxEdsadc_DS7PB_P41_6_IN,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS8PA_P41_0_IN,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR
        },
        {
            &IfxEdsadc_DS9PA_AN50_IN,
            &IfxEdsadc_DS9PB_P41_2_IN,
            NULL_PTR,
            NULL_PTR
        }
    }
};

const IfxEdsadc_Itr_In *IfxEdsadc_Itr_In_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_NUM_CHANNELS][IFXEDSADC_PINMAP_ITR_IN_NUM_ITEMS] = {
    {
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR0E_P33_0_IN,
            &IfxEdsadc_ITR0F_P33_4_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR1E_P33_1_IN,
            &IfxEdsadc_ITR1F_P33_5_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR2E_P33_2_IN,
            &IfxEdsadc_ITR2F_P33_6_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR3E_P02_8_IN,
            &IfxEdsadc_ITR3F_P00_9_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR4E_P02_7_IN,
            &IfxEdsadc_ITR4F_P00_6_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR5E_P02_6_IN,
            &IfxEdsadc_ITR5F_P00_3_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR6E_P01_0_IN,
            &IfxEdsadc_ITR6F_P00_15_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR7E_P01_4_IN,
            &IfxEdsadc_ITR7F_P01_3_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR8E_P01_1_IN,
            &IfxEdsadc_ITR8F_P01_7_IN
        },
        {
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            NULL_PTR,
            &IfxEdsadc_ITR9E_P01_11_IN,
            &IfxEdsadc_ITR9F_P01_10_IN
        }
    }
};

const IfxEdsadc_Sg_In *IfxEdsadc_Sg_In_pinTable[IFXEDSADC_PINMAP_NUM_MODULES][IFXEDSADC_PINMAP_SG_IN_NUM_ITEMS] = {
    {
        &IfxEdsadc_SGNA_P00_4_IN,
        &IfxEdsadc_SGNB_P33_13_IN
    }
};
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
